# Библиотека Pandas

In [8]:
import pandas as pd
import numpy as np

## Series

Создать структуру Series можно на базе различных типов данных:

* словари Python;
* списки Python;
* массивы из numpy: ndarray;
* скалярные величины.

```pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)```

data – массив, словарь или скалярное значение, на базе которого будет построен Series;

index – список меток, который будет использоваться для доступа к элементам Series. Длина списка должна быть равна длине data;

dtype – объект numpy.dtype, определяющий тип данных;

copy – создает копию массива данных, если параметр равен True в ином случае ничего не делает.

## Создание Series из списка Python

Самый простой способ создать Series – это передать в качестве единственного параметра в конструктор класса список Python.

In [4]:
s1 = pd.Series([1, 2, 3, 4, 5])

print(s1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
s2 = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])

print(s2)

a    1
b    2
c    3
d    4
e    5
dtype: int64

## Создание Series из ndarray массива из numpy

In [9]:
ndarr = np.array([1, 2, 3, 4, 5])

print(type(ndarr))

s3 = pd.Series(ndarr, ['a', 'b', 'c', 'd', 'e'])

print(s3)

<class 'numpy.ndarray'>
a    1
b    2
c    3
d    4
e    5
dtype: int32

## Создание Series из словаря (dict)

In [16]:
dct = {'a': 1, 'b': 2, 'c': 3}
s4 = pd.Series(dct)
print(s4)

a    1
b    2
c    3
dtype: int64

## Создание Series с использованием константы

In [12]:
a = 7
s5 = pd.Series(index=['a', 'b', 'c', 'd', 'e'], data=a)
print(s5)

a    7
b    7
c    7
d    7
e    7
dtype: int64

## Работа с элементами Series

In [14]:
s6 = pd.Series([1, 2, 3, 4, 5], ['a', 'b', 'c', 'd', 'e'])
print(s6)
s6[2]

a    1
b    2
c    3
d    4
e    5
dtype: int64

3

In [20]:
s6['d']

4

In [21]:
s6[0:2]

a    1
b    2
dtype: int64

In [15]:
s6[s6 >= 3]

b    2
c    3
d    4
dtype: int64

In [19]:
s6[lambda x: x**2 >= 3]

b    2
c    3
d    4
e    5
dtype: int64

#### Со структурами Series можно работать как с векторами: складывать, умножать вектор на число и т.п.

In [20]:
s6

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [25]:
s7

a    10
b    20
c    30
d    40
f    50
dtype: int64

In [26]:
s7 = pd.Series([10, 20, 30, 40, 50], ['a', 'b', 'c', 'd', 'e'])

s6 + s7

a    11
b    22
c    33
d    44
e    55
dtype: int64

In [27]:
s6 * 3

a     3
b     6
c     9
d    12
e    15
dtype: int64

## Структура данных DataFrame

Если Series представляет собой одномерную структуру, которую для себя можно представить как таблицу с одной строкой, то DataFrame – это уже двумерная структура – полноценная таблица с множеством строк и столбцов.

```class pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)```

data – массив ndarray, словарь (dict) или другой DataFrame;

index – список меток для записей (имена строк таблицы);

columns – список меток для полей (имена столбцов таблицы);

dtype – объект numpy.dtype, определяющий тип данных;

copy – создает копию массива данных, если параметр равен True в ином случае ничего не делает.

Структуру DataFrame можно создать на базе:

* словаря (dict) в качестве элементов которого должны выступать: одномерные ndarray, списки, другие словари, структуры Series;
* двумерные ndarray;
* структуры Series;
* структурированные ndarray;
* другие DataFrame.

## Создание DataFrame из словаря

In [32]:
d = {"price": pd.Series([1, 2, 3], index=['v1', 'v2', 'v4']),
     "count": pd.Series([10, 12, 7, 5, 11], index=['v1', 'v2', 'v3', 'v4', 'v5'])}

In [33]:
df1 = pd.DataFrame(d)

In [34]:
print(df1)

    price  count
v1    1.0     10
v2    2.0     12
v3    NaN      7
v4    3.0      5
v5    NaN     11

In [35]:
print(df1.index)

Index(['v1', 'v2', 'v3', 'v4', 'v5'], dtype='object')

In [36]:
print(df1.columns)

Index(['price', 'count'], dtype='object')

In [37]:
d2 = {"price": np.array([1, 2, 3]),
      "count": np.array([10, 12, 7])}
df2 = pd.DataFrame(d2, index=['v1', 'v2', 'v3'])

In [38]:
print(df2)
print(df2.index)
print(df2.columns)

    price  count
v1      1     10
v2      2     12
v3      3      7
Index(['v1', 'v2', 'v3'], dtype='object')
Index(['price', 'count'], dtype='object')

## Создание DataFrame из списка словарей

In [40]:
d3 = [{"price": 3, "count":8}, {"price": 4, "count": 11}]
df3 = pd.DataFrame(d3)
print(df3)

   count  price
0      8      3
1     11      4

In [41]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
count    2 non-null int64
price    2 non-null int64
dtypes: int64(2)
memory usage: 112.0 bytes

## Создание DataFrame из двумерного массива

In [37]:
nda1 = np.array([[1, 2, 3], [10, 20, 30]])
df4 = pd.DataFrame(nda1)
print(df4)

    0   1   2
0   1   2   3
1  10  20  30

In [40]:
nda1 = np.array([[1, 2, 3], [10, 20, 30]])
df4 = pd.DataFrame(nda1, columns=['col1', 'col2', 'col3'])
print(df4)

   col1  col2  col3
0     1     2     3
1    10    20    30

## Работа с элементами DataFrame

Основные подходы представлены в таблице ниже.

<table>
<tbody>
<tr>
<td><b>Операция</b></td>
<td><b>Синтаксис</b></td>
<td><b>Возвращаемый результат</b></td>
</tr>
<tr>
<td><span style="font-weight: 400;">Выбор столбца</span></td>
<td><span style="font-weight: 400;">df[col]</span></td>
<td><i><span style="font-weight: 400;">Series</span></i></td>
</tr>
<tr>
<td><span style="font-weight: 400;">Выбор строки по метке</span></td>
<td><span style="font-weight: 400;">df.loc[label]</span></td>
<td><i><span style="font-weight: 400;">Series</span></i></td>
</tr>
<tr>
<td><span style="font-weight: 400;">Выбор строки по индексу</span></td>
<td><span style="font-weight: 400;">df.iloc[loc]</span></td>
<td><i><span style="font-weight: 400;">Series</span></i></td>
</tr>
<tr>
<td><span style="font-weight: 400;">Слайс по строкам</span></td>
<td><span style="font-weight: 400;">df[0:4]</span></td>
<td><i><span style="font-weight: 400;">DataFrame</span></i></td>
</tr>
<tr>
<td><span style="font-weight: 400;">Выбор строк, отвечающих условию</span></td>
<td><span style="font-weight: 400;">df[bool_vec]</span></td>
<td><i><span style="font-weight: 400;">DataFrame</span></i></td>
</tr>
</tbody>
</table>

In [43]:
d = {"price": np.array([1, 2, 3]),
     "count": np.array([10, 20, 30])}
df = pd.DataFrame(d, index=['a', 'b', 'c'])

In [44]:
print(df)

   price  count
a      1     10
b      2     20
c      3     30

In [45]:
df

   price  count
a      1     10
b      2     20
c      3     30

In [46]:
df['count']

a    10
b    20
c    30
Name: count, dtype: int32

In [49]:
print(df.loc['a'])

price     1
count    10
Name: a, dtype: int32

In [48]:
print(df.iloc[1])

price     2
count    20
Name: b, dtype: int32

In [53]:
print(df[0:2])

   price  count
a      1     10
b      2     20

In [49]:
df

   price  count
a      1     10
b      2     20
c      3     30

In [54]:
df[df['count'] >= 20]

   price  count
b      2     20
c      3     30

### Получение элементов столбцов ‘count’ и ‘price’:

In [58]:
a = np.array([1, 2, 3, 4, 5, 6, 7])
a[[0, 5]]

array([1, 6])

In [57]:
df_new = df[['count','price']]

   count  price
a     10      1
b     20      2
c     30      3

### Получение элементов с метками от ‘a’ до ‘b’.

In [60]:
df['c':'b']

Empty DataFrame
Columns: [price, count]
Index: []

### Обращение через callable функцию

In [63]:
df[lambda x: x['count'] > 15]

   price  count
b      2     20
c      3     30

### Обращение через логическое выражение

In [64]:
df[df['price'] >= 2]

   price  count
b      2     20
c      3     30

In [66]:
df

   price  count
a      1     10
b      2     20
c      3     30

In [72]:
df[df['price'] >= 2]

   price  count
b      2     20
c      3     30

In [73]:
df

   price  count
a      1     10
b      2     20
c      3     30

In [74]:
df[(df['price'] >= 2)|(df['count'] >= 30)]

   price  count
b      2     20
c      3     30

## Использование атрибутов для доступа к данным

In [75]:
d = {"price":[1, 2, 3], "count": [10, 20, 30], "percent": [24, 51, 71]}
df = pd.DataFrame(d, index=['a', 'b', 'c'])

In [79]:
df[df.price >= 2]

   price  count  percent
b      2     20       51
c      3     30       71

## Получение случайного набора из структур pandas

In [80]:
s = pd.Series([10, 20, 30, 40, 50], ['a', 'b', 'c', 'd', 'e'])

In [85]:
s.sample()

d    40
dtype: int64

In [86]:
s.sample(n=3)

a    10
c    30
d    40
dtype: int64

In [87]:
s.sample(frac=0.3)

e    50
c    30
dtype: int64

### В нашей тестовой структуре пять элементов, сформируем вектор весов для нее и сделаем выборку из трех элементов.

In [98]:
w = [0.1, 0.2, 0.5, 0.1, 0.1]
s.sample(n = 3, weights=w)

b    20
c    30
e    50
dtype: int64

In [99]:
d = {"price":[1, 2, 3, 5, 6], "count": [10, 20, 30, 40, 50], "percent": [24, 51, 71, 25, 42]}
df = pd.DataFrame(d)

In [101]:
df

   price  count  percent
0      1     10       24
1      2     20       51
2      3     30       71
3      5     40       25
4      6     50       42

In [100]:
df.sample()

   price  count  percent
2      3     30       71

In [74]:
df.sample(n=2)

   price  count  percent
3      5     40       25
4      6     50       42

### При работе с DataFrame можно указать ось.

In [72]:
df.sample(axis=1)

   count
0     10
1     20
2     30
3     40
4     50

In [73]:
df.sample(n=2, axis=1)

   count  price
0     10      1
1     20      2
2     30      3
3     40      5
4     50      6

## Добавление элементов в структуры

In [102]:
s = pd.Series([10, 20, 30, 40, 50], ['a', 'b', 'c', 'd', 'e'])

print(s)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [103]:
s['f'] = 60

print(s)

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [104]:
d = {"price":[1, 2, 3, 5, 6], "count": [10, 20, 30, 40, 50], "percent": [24, 51, 71, 25, 42]}
df = pd.DataFrame(d)
print(df)

   price  count  percent
0      1     10       24
1      2     20       51
2      3     30       71
3      5     40       25
4      6     50       42

In [105]:
df['value'] = [3, 14, 7, 91, 5]

print(df)

   price  count  percent  value
0      1     10       24      3
1      2     20       51     14
2      3     30       71      7
3      5     40       25     91
4      6     50       42      5

## Индексация с использованием логических выражений

In [83]:
s = pd.Series([10, 20, 30, 40, 50, 10, 10], ['a', 'b', 'c', 'd', 'e', 'f', 'g'])

s[s>30]

d    40
e    50
dtype: int64

In [84]:
s[s==10]

a    10
f    10
g    10
dtype: int64

In [85]:
s[(s>=30) & (s<50)]

c    30
d    40
dtype: int64

### При работе с DataFrame необходимо указывать столбец по которому будет производиться фильтрация (выборка).

In [106]:
d = {"price":[1, 2, 3, 5, 6], "count": [10, 20, 30, 40, 50], "percent": [24, 51, 71, 25, 42],
     "cat":["A", "B", "A", "A", "C"]}
df = pd.DataFrame(d)

In [88]:
df

   price  count  percent cat
0      1     10       24   A
1      2     20       51   B
2      3     30       71   A
3      5     40       25   A
4      6     50       42   C

In [89]:
df[df["price"] > 3]

   price  count  percent cat
3      5     40       25   A
4      6     50       42   C

### В качестве логического выражения можно использовать довольно сложные конструкции с использованием map, filter, лямбда-выражений и т.п.

In [117]:
df['cat']

0    A
1    B
2    A
3    A
4    C
Name: cat, dtype: object

In [109]:
fn = df["cat"].map(lambda y: x.upper() == "A")

In [110]:
fn

0     True
1    False
2     True
3     True
4    False
Name: cat, dtype: bool

In [118]:
df

   price  count  percent cat
0      1     10       24   A
1      2     20       51   B
2      3     30       71   A
3      5     40       25   A
4      6     50       42   C

In [94]:
df[fn]

   price  count  percent cat
0      1     10       24   A
2      3     30       71   A
3      5     40       25   A

## Использование isin для работы с данными в pandas

In [119]:
s = pd.Series([10, 20, 30, 40, 50, 10, 10], ['a', 'b', 'c', 'd', 'e', 'f', 'g'])

s

a    10
b    20
c    30
d    40
e    50
f    10
g    10
dtype: int64

In [120]:
s.isin([10, 20])

a     True
b     True
c    False
d    False
e    False
f     True
g     True
dtype: bool

In [123]:
s[s.isin(set([10, 20]))]

a    10
b    20
f    10
g    10
dtype: int64

In [124]:
df = pd.DataFrame({"price":[1, 2, 3, 5, 6], "count": [10, 20, 30, 40, 50], "percent": [24, 51, 71, 25, 42]})

In [126]:
df[df.isin([1, 3, 25, 30, 10])]

   price  count  percent
0    1.0   10.0      NaN
1    NaN    NaN      NaN
2    3.0   30.0      NaN
3    NaN    NaN     25.0
4    NaN    NaN      NaN

In [130]:
df

   price  count  percent
0      1     10       24
1      2     20       51
2      3     30       71
3      5     40       25
4      6     50       42

In [129]:
df['price'].isin(my_set)

0    False
1     True
2     True
3    False
4     True
Name: price, dtype: bool

In [128]:
my_set = set([2, 3, 6, 6])

print(my_set)

df[df['price'].isin(my_set)]

{2, 3, 6}

   price  count  percent
1      2     20       51
2      3     30       71
4      6     50       42

## pandas и отсутствующие данные

In [139]:
df = pd.read_csv('data.csv')

In [140]:
df

   price  count  percent
0      1     10      NaN
1      2     20     51.0
2      3     30      NaN

In [141]:
df.loc[3] = {'price': 4, 'count': None, 'percent': 26.3}

In [137]:
df['new_col'] = [1, 2, 3, 4]

In [142]:
df

   price  count  percent
0    1.0   10.0      NaN
1    2.0   20.0     51.0
2    3.0   30.0      NaN
3    4.0    NaN     26.3

In [143]:
pd.isnull(df)

   price  count  percent
0  False  False     True
1  False  False    False
2  False  False     True
3  False   True    False

In [144]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 3 columns):
price      4 non-null float64
count      3 non-null float64
percent    2 non-null float64
dtypes: float64(3)
memory usage: 128.0 bytes

In [147]:
df.isnull()

   price  count  percent
0  False  False     True
1  False  False    False
2  False  False     True
3  False   True    False

In [145]:
df.isnull().sum()

price      0
count      1
percent    2
dtype: int64

## Замена отсутствующих данных

In [151]:
df.fillna(0)

   price  count  percent
0    1.0   10.0      0.0
1    2.0   20.0     51.0
2    3.0   30.0      0.0
3    4.0    0.0     26.3

In [109]:
df.fillna(df.mean())

   price  count  percent
0    1.0   10.0    38.65
1    2.0   20.0    51.00
2    3.0   30.0    38.65
3    4.0   20.0    26.30

In [110]:
df.fillna(df.median())

   price  count  percent
0    1.0   10.0    38.65
1    2.0   20.0    51.00
2    3.0   30.0    38.65
3    4.0   20.0    26.30

## Удаление объектов/столбцов с отсутствующими данными

In [113]:
df

   price  count  percent
0    1.0   10.0      NaN
1    2.0   20.0     51.0
2    3.0   30.0      NaN
3    4.0    NaN     26.3

In [152]:
df.dropna()

   price  count  percent
1    2.0   20.0     51.0

In [157]:
df[~df['count'].isnull()]

   price  count  percent
0    1.0   10.0      NaN
1    2.0   20.0     51.0
2    3.0   30.0      NaN

In [112]:
df.dropna(axis=1)

   price
0    1.0
1    2.0
2    3.0
3    4.0

pandas позволяет задать порог на количество не-NaN элементов. В приведенном ниже примере будут удалены все столбцы, в которых количество не-NaN элементов меньше трех.

In [114]:
df.dropna(axis = 1, thresh=3)

   price  count
0    1.0   10.0
1    2.0   20.0
2    3.0   30.0
3    4.0    NaN

## Pandas merge (join)

In [159]:
user_usage = pd.read_csv('user_usage.csv')

In [166]:
user_usage.head()

   outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                    21.97                    4.82     1557.33   22787
1                  1710.08                  136.88     7267.55   22788
2                  1710.08                  136.88     7267.55   22789
3                    94.46                   35.17      519.12   22790
4                    71.59                   79.26     1557.33   22792

In [167]:
user_device = pd.read_csv('user_device.csv')

In [168]:
user_device.head()

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

In [171]:
user_device[['use_id', 'platform', 'device']].head()

   use_id platform     device
0   22782      ios  iPhone7,2
1   22783  android    Nexus 5
2   22784  android   SM-G903F
3   22785      ios  iPhone7,2
4   22786  android  ONE E1003

In [169]:
devices = pd.read_csv('android_devices.csv')

In [170]:
devices.head(10)

,Retail Branding,Marketing Name,Device,Model
0,NaN,NaN,AD681H,Smartfren Andromax AD681H
1,NaN,NaN,FJL21,FJL21
2,NaN,NaN,T31,Panasonic T31
3,NaN,NaN,hws7721g,MediaPad 7 Youth 2
4,3Q,OC1020A,OC1020A,OC1020A
5,7Eleven,IN265,IN265,IN265
6,A.O.I. ELECTRONICS FACTORY,A.O.I.,TR10CS1_11,TR10CS1
7,AG Mobile,AG BOOST 2,BOOST2,E4010
8,AG Mobile,AG Flair,AG_Flair,Flair
9,AG Mobile,AG Go Tab Access 2,AG_Go_Tab_Access_2,AG_Go_Tab_Access_2

In [180]:
result = pd.merge(user_usage,
                 user_device[['use_id', 'platform', 'device']],
                 on='use_id')
result.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F

In [182]:
user_usage.shape

(240, 4)

In [183]:
user_device.shape

(272, 6)

In [175]:
result.shape

(159, 6)

In [135]:
print(len(result))

159

In [185]:
user_usage['use_id'].isin(user_device['use_id'])

0       True
1       True
2       True
3       True
4       True
5       True
6       True
7       True
8       True
9       True
10      True
11      True
12      True
13      True
14      True
15      True
16      True
17      True
18      True
19      True
20      True
21      True
22      True
23      True
24      True
25      True
26      True
27      True
28      True
29      True
       ...
210    False
211    False
212    False
213    False
214    False
215    False
216    False
217    False
218    False
219    False
220    False
221    False
222    False
223    False
224    False
225    False
226    False
227    False
228    False
229    False
230    False
231    False
232    False
233    False
234    False
235    False
236    False
237    False
238    False
239    False
Name: use_id, Length: 240, dtype: bool

In [189]:
user_device['platform'].value_counts()

android    184
ios         88
Name: platform, dtype: int64

In [186]:
user_usage['use_id'].isin(user_device['use_id']).value_counts()

True     159
False     81
Name: use_id, dtype: int64

## Типы join-ов

<img src="https://shanelynnwebsite-mid9n9g1q9y8tt.netdna-ssl.com/wp-content/uploads/2017/03/join-types-merge-names.jpg"/>

In [191]:
result = pd.merge(
    user_usage,
    user_device[['use_id', 'platform', 'device']],
    on='use_id', 
    how='left'
)
result.head(10)

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F
5,71.59,79.26,1557.33,22793,android,SM-G361F
6,71.59,79.26,519.12,22794,android,SM-G361F
7,71.59,79.26,519.12,22795,android,SM-G361F
8,30.92,22.77,3114.67,22799,android,ONEPLUS A3003
9,69.80,14.70,25955.55,22801,android,GT-I9505

In [192]:
result.shape

(240, 6)

In [193]:
user_usage.shape

(240, 4)

In [137]:
print(len(result))

240

In [194]:
result[result['platform'].isnull()]

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
159,501.92,165.52,2112.59,23057,NaN,NaN
160,60.41,0.80,3114.67,23058,NaN,NaN
161,60.41,0.80,3114.67,23059,NaN,NaN
162,46.40,65.90,1557.33,23073,NaN,NaN
163,38.56,47.65,4025.86,23083,NaN,NaN
164,747.97,65.84,4867.46,23084,NaN,NaN
165,73.49,6.94,1557.33,23142,NaN,NaN
166,41.60,61.51,1557.33,23106,NaN,NaN
167,641.36,336.38,1812.74,23116,NaN,NaN
168,993.35,99.00,11286.04,23143,NaN,NaN
169,73.49,6.94,5191.12,23183,NaN,NaN
170,73.49,6.94,1557.33,23157,NaN,NaN
171,776.34,31.02,5819.47,23205,NaN,NaN
172,48.62,9.13,519.12,23207,NaN,NaN
173,206.03,38.42,664.33,23211,NaN,NaN
174,320.07,366.81,1689.74,23241,NaN,NaN
175,111.74,37.62,703.72,23301,NaN,NaN
176,134.87,497.89,480.25,23420,NaN,NaN
177,293.72,106.26,1320.51,23429,NaN,NaN
178,173.28,94.05,3953.89,23473,NaN,NaN
179,632.06,120.46,1453.16,23482,NaN,NaN
180,632.06,120.46,1453.16,23484,NaN,NaN
181,15.52,18.50,1557.33,23536,NaN,NaN
182,583.73,216.52,1441.29,23548,NaN,NaN
183,190.08,30.92,369.84,23591,NaN,NaN
184,161.21,24.54,1908.59,23609,NaN,NaN
185,300.30,11.66,3251.33,23676,NaN,NaN
186,1816.63,83.65,738.36,23743,NaN,NaN
187,139.34,125.98,1496.01,23823,NaN,NaN
188,113.49,48.16,6015.75,23838,NaN,NaN
...,...,...,...,...,...,...
210,677.02,101.86,1132.23,24318,NaN,NaN
211,677.02,101.86,1132.23,24319,NaN,NaN
212,583.73,216.52,1441.29,24332,NaN,NaN
213,583.73,216.52,1441.29,24333,NaN,NaN
214,333.11,70.91,2814.64,24399,NaN,NaN
215,677.02,101.86,1132.23,24436,NaN,NaN
216,677.02,101.86,1132.23,24437,NaN,NaN
217,677.02,101.86,1132.23,24438,NaN,NaN
218,677.02,101.86,1132.23,24439,NaN,NaN
219,463.05,165.89,362.02,24445,NaN,NaN
220,205.40,42.08,1045.39,24451,NaN,NaN
221,205.40,42.08,1045.39,24455,NaN,NaN
222,436.37,180.33,415.10,24466,NaN,NaN
223,583.73,216.52,1441.29,24545,NaN,NaN
224,512.48,61.63,4565.33,24601,NaN,NaN
225,291.82,109.26,4527.83,24602,NaN,NaN
226,234.70,167.39,2609.20,24647,NaN,NaN
227,291.82,109.26,4527.83,24653,NaN,NaN
228,1083.14,52.03,6215.01,24728,NaN,NaN
229,248.56,133.07,2004.88,24761,NaN,NaN
230,583.73,216.52,1441.29,24764,NaN,NaN
231,74.47,47.03,860.88,24766,NaN,NaN
232,74.47,47.03,860.88,24767,NaN,NaN
233,260.66,68.44,896.96,24885,NaN,NaN
234,558.52,70.64,3334.28,24963,NaN,NaN
235,260.66,68.44,896.96,25008,NaN,NaN
236,97.12,36.50,2815.00,25040,NaN,NaN
237,355.93,12.37,6828.09,25046,NaN,NaN
238,632.06,120.46,1453.16,25058,NaN,NaN
239,488.70,906.92,3089.85,25220,NaN,NaN

In [197]:
result = pd.merge(user_usage,
                 user_device[['use_id', 'platform', 'device']],
                 on='use_id', 
                 how='right')

result.tail(10)

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
262,NaN,NaN,NaN,23035,ios,"iPhone7,2"
263,NaN,NaN,NaN,23037,ios,"iPhone7,1"
264,NaN,NaN,NaN,23038,ios,"iPhone7,1"
265,NaN,NaN,NaN,23042,android,SM-G900F
266,NaN,NaN,NaN,23045,ios,"iPhone7,1"
267,NaN,NaN,NaN,23047,ios,"iPhone7,1"
268,NaN,NaN,NaN,23048,android,ONEPLUS A3003
269,NaN,NaN,NaN,23050,ios,"iPhone7,2"
270,NaN,NaN,NaN,23051,ios,"iPhone7,2"
271,NaN,NaN,NaN,23052,ios,"iPhone8,4"

In [199]:
user_device.shape

(272, 6)

In [140]:
print(len(result))

272

## Индикатор join-a (merge-а)

In [201]:
result.shape

(353, 7)

In [203]:
result = pd.merge(user_usage,
                 user_device[['use_id', 'platform', 'device']],
                 on='use_id', 
                 how='outer', 
                 indicator=True)

result.iloc[[0, 1, 200, 201, 350, 351]]

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device,_merge
0,21.97,4.82,1557.33,22787,android,GT-I9505,both
1,1710.08,136.88,7267.55,22788,android,SM-G930F,both
200,28.79,29.42,3114.67,23988,NaN,NaN,left_only
201,616.56,99.85,5414.14,24006,NaN,NaN,left_only
350,NaN,NaN,NaN,23050,ios,"iPhone7,2",right_only
351,NaN,NaN,NaN,23051,ios,"iPhone7,2",right_only

## Финальный merge

In [205]:
devices.head()

  Retail Branding Marketing Name    Device                      Model
0             NaN            NaN    AD681H  Smartfren Andromax AD681H
1             NaN            NaN     FJL21                      FJL21
2             NaN            NaN       T31              Panasonic T31
3             NaN            NaN  hws7721g         MediaPad 7 Youth 2
4              3Q        OC1020A   OC1020A                    OC1020A

In [207]:
result = pd.merge(user_usage,
                 user_device[['use_id', 'platform', 'device']],
                 on='use_id',
                 how='left')

In [208]:
result.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F

In [225]:
# First, add the platform and device to the user usage - use a left join this time.
result = pd.merge(user_usage,
                 user_device[['use_id', 'platform', 'device']],
                 on='use_id',
                 how='left')
# At this point, the platform and device columns are included
# in the result along with all columns from user_usage
# Now, based on the "device" column in result, match the "Model" column in devices.
devices.rename(columns={"Retail Branding": "manufacturer"}, inplace=True)
result = pd.merge(result, 
                  devices[['manufacturer', 'Model']],
                  left_on='device',
                  right_on='Model',
                  how='left')
result.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device,manufacturer,Model
0,21.97,4.82,1557.33,22787,android,GT-I9505,Samsung,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F,Samsung,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F,Samsung,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303,Sony,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F,Samsung,SM-G361F

## Расчет статистики

In [226]:
result.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device,manufacturer,Model
0,21.97,4.82,1557.33,22787,android,GT-I9505,Samsung,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F,Samsung,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F,Samsung,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303,Sony,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F,Samsung,SM-G361F

In [228]:
result_agg = result.groupby("manufacturer").agg({
        "outgoing_mins_per_month": ["mean", "median"],
        "outgoing_sms_per_month": "mean",
        "monthly_mb": "mean",
        "use_id": "count"
    })

In [229]:
result_agg

             outgoing_mins_per_month         outgoing_sms_per_month  \
                                mean  median                   mean
manufacturer
HTC                       299.842955  250.87              93.059318
Huawei                     81.526667  115.26               9.500000
LGE                       111.530000  111.53              12.760000
Lava                       60.650000   60.65             261.900000
Lenovo                    215.920000  215.92              12.930000
Motorola                   95.127500  102.66              65.666250
OnePlus                   354.855000  361.19              48.330000
Samsung                   191.010093  145.55              92.390463
Sony                      177.315625  140.77              40.176250
Vodafone                   42.750000   42.75              46.830000
ZTE                        42.750000   42.75              46.830000

                monthly_mb use_id
                      mean  count
manufacturer
HTC            5144.077955     44
Huawei         1561.226667      3
LGE            1557.330000      2
Lava          12458.670000      2
Lenovo         1557.330000      2
Motorola       3946.500000     16
OnePlus        6575.410000      6
Samsung        4017.318889    108
Sony           3212.000625     16
Vodafone       5191.120000      1
ZTE            5191.120000      1

In [149]:
result_agg.values

array([[2.99842955e+02, 9.30593182e+01, 5.14407795e+03, 4.40000000e+01],
       [8.15266667e+01, 9.50000000e+00, 1.56122667e+03, 3.00000000e+00],
       [1.11530000e+02, 1.27600000e+01, 1.55733000e+03, 2.00000000e+00],
       [6.06500000e+01, 2.61900000e+02, 1.24586700e+04, 2.00000000e+00],
       [2.15920000e+02, 1.29300000e+01, 1.55733000e+03, 2.00000000e+00],
       [9.51275000e+01, 6.56662500e+01, 3.94650000e+03, 1.60000000e+01],
       [3.54855000e+02, 4.83300000e+01, 6.57541000e+03, 6.00000000e+00],
       [1.91010093e+02, 9.23904630e+01, 4.01731889e+03, 1.08000000e+02],
       [1.77315625e+02, 4.01762500e+01, 3.21200063e+03, 1.60000000e+01],
       [4.27500000e+01, 4.68300000e+01, 5.19112000e+03, 1.00000000e+00],
       [4.27500000e+01, 4.68300000e+01, 5.19112000e+03, 1.00000000e+00]])

In [150]:
result_agg.index

Index(['HTC', 'Huawei', 'LGE', 'Lava', 'Lenovo', 'Motorola', 'OnePlus',
       'Samsung', 'Sony', 'Vodafone', 'ZTE'],
      dtype='object', name='manufacturer')

## Group by

In [212]:
data_url = 'http://vincentarelbundock.github.io/Rdatasets/csv/carData/Salaries.csv'
df = pd.read_csv(data_url, index_col=0)
 
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
1      Prof          B             19           18  Male  139750
2      Prof          B             20           16  Male  173200
3  AsstProf          B              4            3  Male   79750
4      Prof          B             45           39  Male  115000
5      Prof          B             40           41  Male  141500

In [214]:
df['rank'].value_counts()

Prof         266
AsstProf      67
AssocProf     64
Name: rank, dtype: int64

In [215]:
# Grouping by one factor
df_rank = df.groupby('rank')

In [216]:
df_rank

In [217]:
df_rank.groups

{'AssocProf': Int64Index([  6,  11,  25,  40,  42,  55,  56,  58,  59,  61,  64,  66,  90,
              92,  93,  97, 105, 107, 108, 109, 112, 124, 131, 133, 139, 141,
             142, 154, 157, 159, 163, 169, 175, 177, 178, 183, 187, 189, 194,
             195, 196, 215, 218, 219, 223, 228, 232, 256, 258, 261, 285, 286,
             294, 300, 317, 322, 323, 329, 335, 364, 368, 371, 380, 383],
            dtype='int64'),
 'AsstProf': Int64Index([  3,  12,  13,  14,  28,  29,  32,  34,  35,  36,  38,  50,  53,
              60,  62,  65,  76,  79,  80,  84,  88,  91,  96, 113, 119, 120,
             128, 130, 134, 144, 147, 150, 152, 155, 158, 161, 164, 165, 171,
             180, 197, 198, 201, 209, 211, 227, 235, 238, 241, 254, 259, 273,
             274, 275, 288, 290, 307, 309, 316, 326, 349, 355, 360, 377, 378,
             381, 397],
            dtype='int64'),
 'Prof': Int64Index([  1,   2,   4,   5,   7,   8,   9,  10,  15,  16,
             ...
             387, 388, 389, 390, 391, 392, 393, 394, 395, 396],
            dtype='int64', length=266)}

In [218]:
df_rank.get_group('AsstProf').head()

        rank discipline  yrs.since.phd  yrs.service   sex  salary
3   AsstProf          B              4            3  Male   79750
12  AsstProf          B              7            2  Male   79800
13  AsstProf          B              1            1  Male   77700
14  AsstProf          B              2            0  Male   78000
28  AsstProf          B              5            3  Male   82379

In [156]:
df_rank.size()

rank
AssocProf     64
AsstProf      67
Prof         266
dtype: int64

In [157]:
df_rank.count()

           discipline  yrs.since.phd  yrs.service  sex  salary
rank
AssocProf          64             64           64   64      64
AsstProf           67             67           67   67      67
Prof              266            266          266  266     266

In [158]:
df_rank.nunique()

           rank  discipline  yrs.since.phd  yrs.service  sex  salary
rank
AssocProf     1           2             24           21    2      63
AsstProf      1           2             11            7    2      53
Prof          1           2             42           50    2     261

In [160]:
df_null = df.mask(np.random.random(df.shape) < .1)
df_null.isnull().sum().reset_index(name='N Missing Values')

           index  N Missing Values
0           rank                30
1     discipline                34
2  yrs.since.phd                38
3    yrs.service                47
4            sex                48
5         salary                50

In [161]:
df_null.groupby('rank').nunique()

           rank  discipline  yrs.since.phd  yrs.service  sex  salary
rank
AssocProf     1           2             24           20    2      52
AsstProf      1           2             11            6    2      48
Prof          1           2             40           50    2     204

In [222]:
df_rank['salary'].mean().reset_index()

        rank         salary
0  AssocProf   93876.437500
1   AsstProf   80775.985075
2       Prof  126772.109023

In [163]:
df_rank['salary'].mean().reset_index().rename(
    columns={'rank':'Rank','salary' : 'Mean Salary'}
)

        Rank    Mean Salary
0  AssocProf   93876.437500
1   AsstProf   80775.985075
2       Prof  126772.109023

In [223]:
df_rank['salary'].agg(['mean', 'median', 
                       'std', 'min', 'max']).reset_index()

        rank           mean    median           std    min     max
0  AssocProf   93876.437500   95626.5  13831.699844  62884  126431
1   AsstProf   80775.985075   79800.0   8174.112637  63100   97032
2       Prof  126772.109023  123321.5  27718.674999  57800  231545